In [1]:
import pandas as pd

# create a list of data
data = [10, 20, 30, 40, 50, 60, 70, 80, 90, 100, 110, 120]

# create a pandas DataFrame from the data
df = pd.DataFrame(data, columns=['values'])

# add an outlier value to the DataFrame
df.loc[12] = 150

# display the DataFrame
print(df)

    values
0       10
1       20
2       30
3       40
4       50
5       60
6       70
7       80
8       90
9      100
10     110
11     120
12     150

In [2]:
df

    values
0       10
1       20
2       30
3       40
4       50
5       60
6       70
7       80
8       90
9      100
10     110
11     120
12     150

In [3]:
describe= df.describe().transpose()

In [4]:
describe

        count       mean        std   min   25%   50%    75%    max
values   13.0  71.538462  41.802343  10.0  40.0  70.0  100.0  150.0

In [5]:
describe['25%'][0]

40.0

In [6]:
describe['75%'][0]

100.0

In [24]:
# Original df shape
df.shape

(13, 1)

In [7]:
# Cap outliers

def cap_outlier(df, column, lower_cap, upper_cap):
    df[column]= df[column].clip(lower= lower_cap, upper= upper_cap)
    return df

df_new= cap_outlier(df, 'values', 25, 75)
df_new

    values
0       25
1       25
2       30
3       40
4       50
5       60
6       70
7       75
8       75
9       75
10      75
11      75
12      75

In [25]:
# Capped df_new shape
df_new.shape

(13, 1)

In [8]:
# create a list of data
data2 = [10, 20, 30, 40, 50, 60, 70, 80, 90, 100, 110, 120]

# create a pandas DataFrame from the data
df2 = pd.DataFrame(data2, columns=['values'])

# add an outlier value to the DataFrame
df2.loc[12] = 150

# display the DataFrame
print(df2)

    values
0       10
1       20
2       30
3       40
4       50
5       60
6       70
7       80
8       90
9      100
10     110
11     120
12     150

In [9]:
df2

    values
0       10
1       20
2       30
3       40
4       50
5       60
6       70
7       80
8       90
9      100
10     110
11     120
12     150

In [11]:
df2['Int']= [1,2,3,4,5,6,7,8,9,10,11,12,13]

In [12]:
df2

    values  Int
0       10    1
1       20    2
2       30    3
3       40    4
4       50    5
5       60    6
6       70    7
7       80    8
8       90    9
9      100   10
10     110   11
11     120   12
12     150   13

In [13]:
def remove_outliers(df, column, lower_threshold, upper_threshold):
    df = df[(df[column] > lower_threshold) & (df[column] < upper_threshold)]
    return df

df_new2 = remove_outliers(df2, 'values', 25, 75)
df_new2

   values  Int
2      30    3
3      40    4
4      50    5
5      60    6
6      70    7

In [26]:
# Deleted outlier df_new2 shape
df_new2.shape

(5, 2)

In [19]:
# Null value
df3= pd.DataFrame()
df3['Int1']= [1,2,3,4,5,6,7,8,None,10,11,12,13]
df3['Int2']= [1,2,3,4,5,6,7,8,9,10,11,12,13]
df3

    Int1  Int2
0    1.0     1
1    2.0     2
2    3.0     3
3    4.0     4
4    5.0     5
5    6.0     6
6    7.0     7
7    8.0     8
8    NaN     9
9   10.0    10
10  11.0    11
11  12.0    12
12  13.0    13

In [22]:
df3.shape

(13, 2)

In [21]:
# Drop rows having Nan value
df3_new= df3.dropna()
df3_new

    Int1  Int2
0    1.0     1
1    2.0     2
2    3.0     3
3    4.0     4
4    5.0     5
5    6.0     6
6    7.0     7
7    8.0     8
9   10.0    10
10  11.0    11
11  12.0    12
12  13.0    13

In [23]:
df3_new.shape

(12, 2)